{
  "title": "Sky Sports Full Articles Content",
  "totalArticles": 3,
  "extractedAt": "2025-08-23T22:02:09.460Z",
  "articles": [
    {
      "title": "Burnley latest: 'We are scanning the market,' says Parker",
      "link": "https://www.skysports.com/football/live-blog/11095/13353582/burnley-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
      "imageUrl": "https://e0.365dm.com/25/04/768x432/skysports-scott-parker_6894397.jpg?20250423095458",
      "totalArticles": 4,
      "articles": [
        {
          "subheading": "Parker: Burnley remain active in the transfer window",
          "timestamp": "2025-08-23T17:09:09.000Z",
          "content": "Scott Parker has insisted Burnley are still \"scanning\" the transfer market to add reinforcements before Deadline Day on September 1. \"We will hopefully try and do something. We are looking in certain areas,\" Parker said in his press conference after the 2-0 win against Sunderland. \"There is a lot of things that need to fall into place. If we can add to our quality, we are scanning and looking to see where quality can be added.\"",
          "divIndex": 1
        },
        {
          "subheading": "Promoted sides showing fight to stay up",
          "timestamp": "2025-08-23T17:39:26.000Z",
          "content": "Sky Sports' Patrick Rowe: It took until October for all three promoted sides to win a game in the Premier League last season. This season, it has only taken two weeks. Burnley, Sunderland and Leeds United have already won half as many home games as last Ipswich, Leicester and Southampton last season, too. It is early days for the newly-promoted trio but all three teams are showing the bravery, determination and quality to secure points in the top-flight. Whether or not they can maintain this momentum throughout the course of the entire season remains to be seen. However, the early signs are promising. All three promoted teams dropped back into the Championship last season - that might not be the case this time round.",
          "divIndex": 2
        },
        {
          "subheading": "Parker: Ugochukwu had cramp, Broja ramping up return",
          "timestamp": "2025-08-23T17:05:19.000Z",
          "content": "Burnley boss Scott Parker has confirmed Lesley Ugochukwu was suffering with cramp during the 2-0 win against Sunderland and has not suffered a serious injury. Ugochukwu started his first game for the Clarets at Turf Moor on Saturday but was forced off in the second half after going down injured. \"Looked, but I have not double checked, like a little bit of cramp. \"Lesley has only been in for a couple of weeks. I knew it would be a change I would have to make. \"He was brilliant today.\" Armando Broja, another new signing from the summer transfer window for Burnley, was not involved in the match-day squad as he continues to gain match fitness. \"He's not far but might just be a little bit behind,\" Parker added on Broja. \"I don't want to risk anything. He just needs a bit more work, hopefully from Tuesday we can start seeing him from then.\"",
          "divIndex": 4
        },
        {
          "subheading": "Report: Cullen and Anthony combine to beat Sunderland",
          "timestamp": "2025-08-23T16:21:45.000Z",
          "content": "Sky Sports",
          "divIndex": 6
        }
      ],
      "collectedAt": "2025-08-23T22:01:09.488Z"
    },
    {
      "title": "Aston Villa latest: Emery wants players' futures resolved before window shuts",
      "link": "https://www.skysports.com/football/live-blog/11677/13025491/aston-villa-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
      "imageUrl": "https://e0.365dm.com/24/07/768x432/skysports-aston-villa-graphic_6618483.jpg?20240705120852",
      "totalArticles": 3,
      "articles": [
        {
          "subheading": "Emery: We need to clarify if some players are staying or not",
          "timestamp": "2025-08-23T17:26:41.000Z",
          "content": "Aston Villa boss Unai Emery remained hopeful the club will do business ahead of the transfer deadline on September 1 after what has been a quiet window. Villa lost 1-0 at Brentford on Saturday meaning they have still to win so far this season, while they have also failed to score after their forwards producing another off-colour display in attack at the Gtech. “We have to clarify some circumstances we have in the transfer window,\" said the Spaniard after the match. \"We have enough players, but we need to clarify with some players if they are staying or not and the possibility we can add some to help us.”",
          "divIndex": 1
        },
        {
          "subheading": "Emery: Keep calm, work the same as we were doing is my message",
          "timestamp": "2025-08-23T17:19:00.000Z",
          "content": "Villa boss Unai Emery on his side's display at the Gtech: “We lost one match today because the first 20 minutes we weren’t really performing with the intensity we needed,” said Emery. “After the goal we reacted, we dominated, we created some chances. They were defending and trying to get one transition. We avoided the attacking transition and we dominated. \"We need to keep working, build a team and be strong like the last three years - last year we needed time, this year is not how we wanted to start, we accept it though. We competed well with Newcastle and today it was not enough and we will try to clarify everything in the transfer window. Keep calm, work the same as we were doing is my message and be strong.\"",
          "divIndex": 3
        },
        {
          "subheading": "REPORT, RATINGS, HIGHLIGHTS: Ouattara winner on Brentford debut to hand Andrews first victory",
          "timestamp": "2025-08-23T16:24:59.000Z",
          "content": "Dango Ouattara's sparking debut display that saw his side edge Aston Villa 1-0 made Brentford's fans forget all about the departed Bryan Mbeumo and the absent Yoane Wissa at a rocking Gtech. Sky Sports",
          "divIndex": 4
        }
      ],
      "collectedAt": "2025-08-23T22:01:37.399Z"
    },
    {
      "title": "Sunderland latest: Le Bris offers Ballard injury update",
      "link": "https://www.skysports.com/football/live-blog/11695/13375102/sunderland-transfer-news-rumours-and-gossip-live-updates-and-latest-on-deals-signings-loans-and-contracts",
      "imageUrl": "https://e0.365dm.com/25/05/768x432/skysports-sunderland-club-blog_6929406.jpg?20250528092613",
      "totalArticles": 3,
      "articles": [
        {
          "subheading": "Le Bris offers Ballard injury update",
          "timestamp": "2025-08-23T16:49:56.000Z",
          "content": "Sunderland boss Regis Le Bris offered an update on Dan Ballard's injury. The centre-back was forced off in the ninth minute of the 2-0 loss to Burnley at Turf Moor with what appeared to be a groin injury. When asked for an update after the defeat, Le Bris said:  \"He is always really important. We will wait until Monday for a diagnosis. It was a groin injury.\" The Sunderland boss was then asked whether the injury would influence their decision-making in the transfer window before it closes on September 1. Le Bris added: \"It is not only connected with the injury. We have our plans and ways we want to build the squad. \"We don't have many signatures to do, there are two specific areas.\"",
          "divIndex": 1
        },
        {
          "subheading": "Promoted sides showing fight to stay up",
          "timestamp": "2025-08-23T17:39:46.000Z",
          "content": "Sky Sports' Patrick Rowe: It took until October for all three promoted sides to win a game in the Premier League last season. This season, it has only taken two weeks. Burnley, Sunderland and Leeds United have already won half as many home games as last Ipswich, Leicester and Southampton last season, too. It is early days for the newly-promoted trio but all three teams are showing the bravery, determination and quality to secure points in the top-flight. Whether or not they can maintain this momentum throughout the course of the entire season remains to be seen. However, the early signs are promising. All three promoted teams dropped back into the Championship last season - that might not be the case this time round.",
          "divIndex": 2
        },
        {
          "subheading": "Report: Cullen and Anthony combine to beat Sunderland",
          "timestamp": "2025-08-23T16:22:36.000Z",
          "content": "Sky Sports",
          "divIndex": 5
        }
      ],
      "collectedAt": "2025-08-23T22:02:06.298Z"
    }
  ]
}